snlkuharlocal/src/Documents/УчетПроизводствМощности/УчетПроизводствМощности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетПроизводствМощности</name>
  <comment>//Михайловский С. 20210921 Доработка по учету производственных мощностей</comment>
  <registerRecords>InformationRegister.УчетПроизводстМощности</registerRecords>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.Станки</types>
    </type>
  </attributes>
  <attributes>
    <name>КолвоСтанков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МощностьВСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МощностьВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/УчетПроизводстМощности/УчетПроизводстМощности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетПроизводстМощности</name>
  <comment>//Михайловский С. 20210921</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Станок</name>
    <type>
      <types>CatalogRef.Станки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/УчетПроизводствМощности/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	// регистр УчетПроизводстМощности
	Движения.УчетПроизводстМощности.Записывать = Истина;
	
	Движения.УчетПроизводстМощности.Очистить();
	Если Товары.Количество() Тогда
		СумКоэф=Товары.Итог("Коэффициент");
		Если СумКоэф=0 Тогда
			СумКоэф=Товары.Количество();
		КонецЕсли;
		ТЗНоменклатура=Товары.Выгрузить();
		ТЗНоменклатура.Свернуть("Номенклатура","Коэффициент");
		Для Каждого СтрокаТЧ Из ТЗНоменклатура Цикл
			Движение = Движения.УчетПроизводстМощности.Добавить();
			Движение.Контрагент=Контрагент;
			Движение.Станок=Станок;
			Движение.ДатаОкончания=ДатаОкончания;
			Движение.Номенклатура=СтрокаТЧ.Номенклатура;
			Движение.Мощность = МощностьВСутки;
		КонецЦикла;
	Иначе
		Движение = Движения.УчетПроизводстМощности.Добавить();
		Движение.Контрагент=Контрагент;
		Движение.Станок=Станок;
		Движение.ДатаОкончания=ДатаОкончания;
		Движение.Мощность = МощностьВСутки;

	КонецЕсли;
	Движения.УчетПроизводстМощности.Записать();
КонецПроцедуры
